たすく
　スキルポイント

----------------------------------
  鍛冶には「対応した素材の消費」が必要なので素手に鍛冶はできない
  カーソルをあわせるとポップアップで説明テキスト

イベントハンドラ「 onClick」 を「 onChange」 に {
  <select onChange = kansu();>
  }

-- -- -- -- -- -- -- -- -- -- - １～６のダイス
a = Math.floor(Math.random() * 6 + 1)
  -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
元となる変数を関数外で宣言する事でグローバルに？

-- -- -- -- -- -- -- -- -- -- -
textareaのコピー
https: //fuuno.net/web02/copy/copy.html

  textareaの編集はinnerHTMLじゃダメっていう話
https: //kaworu.jpn.org/kaworu/2008-04-16-2.php
-- -- -- -- -- -- -- -- -- -- -
<font color = "red" > ああ < font >
  text内で文字色を変える
  -- -- -- -- -- -- --
  //コピペして通っちゃったテキストをコピーする関数
  //https://fuuno.net/web02/copy/copy.html
  //将来的にexecCommandは使えなくなるらしい
  let copy = () => {
    var textarea1 = document.getElementById("textarea1");
    textarea1.select(); //textareaの内容を選択
    document.execCommand("copy"); //コピーを実行するメゾット
  };

  -- -- -- -- -- -- -- -- -- --
all = ['拳', '近', '〈壊〉', '0', '0', '(Lv)', '0', '0', '0',
    '拳(拳マスタリー)近', '〈壊〉', '0', '0', '(Lv×3)+4', '0', '0',
    '短剣', '近', '〈斬〉', '0', '0', '(R×3)+3', '0', '0',
    '剣', '近', '〈斬〉', '0', '0', '(R×3)+5', '0', '0',
    '突剣', '近', '〈突〉', '+1', '0', '(R×3)+4', '0', '+3',
    '槍', '近', '〈突〉', '+1', '0', '(R×3)+5', '0', '-3',
    '斧', '近', '〈壊〉', '-1', '0', '(R×3)+6', '0', '-4',
    '杖', '近', '〈壊〉', '0', '+1', '(R×3)+3', 'R+3', '-4',
    '鎚', '近', '〈壊〉', '-1', '0', '(R×3)+6', '0', '-6',
    '鞭', '近', '〈斬〉', '0', '0', '(R×3)+5', '0', '0',
    '刀', '近', '〈斬〉', '0', '0', '(R×3)+6', '0', '0',
    '砲剣', '近', '〈斬〉', '0', '0', '(R×3)+5', '0', '0',
    '農具(斬)', '近', '〈斬〉', '0', '0', '(R×3)+4', '0', '0',
    '農具(突)', '近', '〈突〉', '0', '0', '(R×3)+4', '0', '0',
    '農具(壊)', '近', '〈壊〉', '0', '0', '(R×3)+4', '0', '0',
    '弓', '遠', '〈突〉', '0', '0', '(R×3)+4', '0', '0',
    '弩', '遠', '〈突〉', '-1', '0', '(R×3)+6', '0', '-8',
    '銃', '遠', '〈突〉', '0', '0', '(R×3)+5', '0', '-4'
  ]
  -- -- -- -- -- -- -- -- -- --
let nssq_status = {
    'プリンセス': {
      'STR': 5,
      'TEC': 6,
      'VIT': 6,
      'AGI': 5,
      'LUC': 6
    },
    'ソードマン': {
      'STR': 7,
      'TEC': 3,
      'VIT': 6,
      'AGI': 5,
      'LUC': 4
    },
    'レンジャー': {
      'STR': 5,
      'TEC': 5,
      'VIT': 5,
      'AGI': 7,
      'LUC': 7
    },
    'パラディン': {
      'STR': 5,
      'TEC': 5,
      'VIT': 7,
      'AGI': 3,
      'LUC': 5
    },
    'ダークハンター': {
      'STR': 6,
      'TEC': 5,
      'VIT': 5,
      'AGI': 6,
      'LUC': 6
    },
    'メディック': {
      'STR': 5,
      'TEC': 6,
      'VIT': 5,
      'AGI': 4,
      'LUC': 4
    },
    'アルケミスト': {
      'STR': 3,
      'TEC': 7,
      'VIT': 4,
      'AGI': 4,
      'LUC': 5
    },
    'バード': {
      'STR': 4,
      'TEC': 5,
      'VIT': 4,
      'AGI': 5,
      'LUC': 6
    },
    'ブシドー': {
      'STR': 7,
      'TEC': 3,
      'VIT': 4,
      'AGI': 5,
      'LUC': 4
    },
    'カースメーカー': {
      'STR': 3,
      'TEC': 6,
      'VIT': 4,
      'AGI': 4,
      'LUC': 6
    },
    'ガンナー': {
      'STR': 6,
      'TEC': 5,
      'VIT': 4,
      'AGI': 5,
      'LUC': 6
    },
    'ドクトルマグス': {
      'STR': 6,
      'TEC': 6,
      'VIT': 5,
      'AGI': 5,
      'LUC': 6
    },
    'ウォリアー': {
      'STR': 7,
      'TEC': 3,
      'VIT': 6,
      'AGI': 4,
      'LUC': 4
    },
    'ファランクス': {
      'STR': 5,
      'TEC': 4,
      'VIT': 7,
      'AGI': 3,
      'LUC': 5
    },
    'パイレーツ': {
      'STR': 6,
      'TEC': 5,
      'VIT': 5,
      'AGI': 6,
      'LUC': 6
    },
    'シノビ': {
      'STR': 6,
      'TEC': 6,
      'VIT': 3,
      'AGI': 7,
      'LUC': 6
    },
    'モンク': {
      'STR': 6,
      'TEC': 6,
      'VIT': 5,
      'AGI': 6,
      'LUC': 3
    },
    'ゾディアック': {
      'STR': 3,
      'TEC': 6,
      'VIT': 4,
      'AGI': 4,
      'LUC': 6
    },
    'ビーストキング': {
      'STR': 6,
      'TEC': 5,
      'VIT': 5,
      'AGI': 4,
      'LUC': 7
    },
    'バリスタ': {
      'STR': 7,
      'TEC': 3,
      'VIT': 4,
      'AGI': 3,
      'LUC': 5
    },
    'ファーマー': {
      'STR': 4,
      'TEC': 3,
      'VIT': 4,
      'AGI': 3,
      'LUC': 7
    },
    'ショーグン': {
      'STR': 7,
      'TEC': 5,
      'VIT': 4,
      'AGI': 6,
      'LUC': 4
    },
    'ナイトシーカー': {
      'STR': 6,
      'TEC': 5,
      'VIT': 4,
      'AGI': 7,
      'LUC': 6
    },
    'フォートレス': {
      'STR': 5,
      'TEC': 5,
      'VIT': 7,
      'AGI': 3,
      'LUC': 5
    },
    'スナイパー': {
      'STR': 6,
      'TEC': 4,
      'VIT': 4,
      'AGI': 5,
      'LUC': 7
    },
    'ルーンマスター': {
      'STR': 3,
      'TEC': 7,
      'VIT': 4,
      'AGI': 4,
      'LUC': 5
    },
    'ダンサー': {
      'STR': 5,
      'TEC': 5,
      'VIT': 4,
      'AGI': 7,
      'LUC': 5
    },
    'ミスティック': {
      'STR': 3,
      'TEC': 6,
      'VIT': 4,
      'AGI': 4,
      'LUC': 6
    },
    'モノノフ': {
      'STR': 7,
      'TEC': 3,
      'VIT': 5,
      'AGI': 5,
      'LUC': 5
    },
    'インペリアル': {
      'STR': 7,
      'TEC': 5,
      'VIT': 7,
      'AGI': 4,
      'LUC': 3
    },
    'ハイランダー': {
      'STR': 7,
      'TEC': 3,
      'VIT': 6,
      'AGI': 5,
      'LUC': 4
    }
  };
let weapon_status = {
  '拳': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': level,
    '属性攻撃': '0',
    '速度': 0
  },
  '拳マスタリー': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': level * 3 + 4,
    '属性攻撃': '0',
    '速度': 0
  },
  '短剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 3,
    '属性攻撃': '0',
    '速度': 0
  },
  '剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 5,
    '属性攻撃': '0',
    '速度': 0
  },
  '突剣': {
    '射程': '近',
    '属性': '突',
    '物理命中': 1,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 4,
    '属性攻撃': '0',
    '速度': 3
  },
  '槍': {
    '射程': '近',
    '属性': '突',
    '物理命中': 1,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 5,
    '属性攻撃': '0',
    '速度': -3
  },
  '斧': {
    '射程': '近',
    '属性': '壊',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 6,
    '属性攻撃': '0',
    '速度': -4
  },
  '杖': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 1,
    '物理攻撃': w_rank * 3 + 3,
    '属性攻撃': w_rank + 3,
    '速度': -4
  },
  '鎚': {
    '射程': '近',
    '属性': '壊',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 6,
    '属性攻撃': '0',
    '速度': -6
  },
  '鞭': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 5,
    '属性攻撃': '0',
    '速度': 0
  },
  '刀': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 6,
    '属性攻撃': '0',
    '速度': 0
  },
  '砲剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 5,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(斬)': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 4,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(突)': {
    '射程': '近',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 4,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(壊)': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 4,
    '属性攻撃': '0',
    '速度': 0
  },
  '弓': {
    '射程': '遠',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 4,
    '属性攻撃': '0',
    '速度': 0
  },
  '弩': {
    '射程': '遠',
    '属性': '突',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 6,
    '属性攻撃': '0',
    '速度': -8
  },
  '銃': {
    '射程': '遠',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank * 3 + 5,
    '属性攻撃': '0',
    '速度': -4
  }
};
let w_forge = ['STR+1', 'TEC+1', 'VIT+1', 'AGI+1', 'LUC+1',
  '物理命中+1', '属性命中+1', '物理攻撃+1', '属性攻撃+1',
  '炎属性付与', '氷属性付与', '雷属性付与'
]
let a_forge = ['STR+1', 'TEC+1', 'VIT+1', 'AGI+1', 'LUC+1',
  '防御+1', '速度+2', '炎耐性+1', '氷耐性+1', '雷耐性+1'
]
let weapon_status={
  '拳': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': level,
    '属性攻撃': '0',
    '速度': 0
  },
  '拳マスタリー': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': level*3+4,
    '属性攻撃': '0',
    '速度': 0
  },
  '短剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+3,
    '属性攻撃': '0',
    '速度': 0
  },
  '剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+5,
    '属性攻撃': '0',
    '速度': 0
  },
  '突剣': {
    '射程': '近',
    '属性': '突',
    '物理命中': 1,
    '属性命中': 0,
    '物理攻撃': w_rank*3+4,
    '属性攻撃': '0',
    '速度': 3
  },
  '槍': {
    '射程': '近',
    '属性': '突',
    '物理命中': 1,
    '属性命中': 0,
    '物理攻撃': w_rank*3+5,
    '属性攻撃': '0',
    '速度': -3
  },
  '斧': {
    '射程': '近',
    '属性': '壊',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank*3+6,
    '属性攻撃': '0',
    '速度': -4
  },
  '杖': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 1,
    '物理攻撃': w_rank*3+3,
    '属性攻撃': w_rank+3,
    '速度': -4
  },
  '鎚': {
    '射程': '近',
    '属性': '壊',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank*3+6,
    '属性攻撃': '0',
    '速度': -6
  },
  '鞭': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+5,
    '属性攻撃': '0',
    '速度': 0
  },
  '刀': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+6,
    '属性攻撃': '0',
    '速度': 0
  },
  '砲剣': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+5,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(斬)': {
    '射程': '近',
    '属性': '斬',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+4,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(突)': {
    '射程': '近',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+4,
    '属性攻撃': '0',
    '速度': 0
  },
  '農具(壊)': {
    '射程': '近',
    '属性': '壊',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+4,
    '属性攻撃': '0',
    '速度': 0
  },
  '弓': {
    '射程': '遠',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+4,
    '属性攻撃': '0',
    '速度': 0
  },
  '弩': {
    '射程': '遠',
    '属性': '突',
    '物理命中': -1,
    '属性命中': 0,
    '物理攻撃': w_rank*3+6,
    '属性攻撃': '0',
    '速度': -8
  },
  '銃': {
    '射程': '遠',
    '属性': '突',
    '物理命中': 0,
    '属性命中': 0,
    '物理攻撃': w_rank*3+5,
    '属性攻撃': '0',
    '速度': -4
  }
}
let other_status = {
  "－": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "盾": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": Math.floor((o_rank+1)/2),
    "回避": -1,
    "速度": -4,
    "効果": "",
  },
  "厚手の手袋": {
    "STR": 1,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "木彫りの髪飾り": {
    "STR": 0,
    "TEC": 1,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "革のベルト": {
    "STR": 0,
    "TEC": 0,
    "VIT": 1,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "ストラップシューズ": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 1,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "花のお守り": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 1,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "知識の書": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": "エネミー識別判定に+1"
  },
  "脱兎のお守り": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": "逃走判定に+2"
  },
  "百中ゴーグル": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 2,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "命のベルト": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 8,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "英気のオーブ": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 5,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "力の指輪": {
    "STR": 3,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "知恵のピアス": {
    "STR": 0,
    "TEC": 3,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "耐力の腕輪": {
    "STR": 0,
    "TEC": 0,
    "VIT": 3,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "俊足のお守り": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 3,
    "LUC": 0,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
  "運のネックレス": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 3,
    "物理命中": 0,
    "HP": 0,
    "TP": 0,
    "防御": 0,
    "回避": 0,
    "速度": 0,
    "効果": ""
  },
}
let weapon_forge_status = {
  "－": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "STR+1": {
    "STR": 1,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "TEC+1": {
    "STR": 0,
    "TEC": 1,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "VIT+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 1,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "AGI+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 1,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "LUC+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 1,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "物理命中+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 1,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "属性命中+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 1,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "効果": "",
  },
  "物理攻撃+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 1,
    "属性攻撃": 0,
    "効果": "",
  },
  "属性攻撃+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 1,
    "効果": "",
  },
  "炎属性付与": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "属性": "炎",
  },
  "氷属性付与": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "属性": "氷",
  },
  "雷属性付与": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "物理命中": 0,
    "属性命中": 0,
    "物理攻撃": 0,
    "属性攻撃": 0,
    "属性": "雷",
  }
}
let armor_forge_status = {
  "－": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "STR+1": {
    "STR": 1,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "TEC+1": {
    "STR": 0,
    "TEC": 1,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "VIT+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 1,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "AGI+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 1,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "LUC+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 1,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "防御+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 1,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "速度+2": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 2,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "炎耐性+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 1,
    "氷耐性": 0,
    "雷耐性": 0,
  },
  "氷耐性+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 1,
    "雷耐性": 0,
  },
  "雷耐性+1": {
    "STR": 0,
    "TEC": 0,
    "VIT": 0,
    "AGI": 0,
    "LUC": 0,
    "防御": 0,
    "速度": 0,
    "炎耐性": 0,
    "氷耐性": 0,
    "雷耐性": 1,
  },

}
